# -*- coding: utf-8 -*-
# @Time    : 2023/11/27 21:06
# @Author  : HuangHonghao
# @File    : emoji_rules.py
# @Description :
word_emoji_dict = {
    "happy": ["😄", "😊", "😁", "😃", "😆"],
    "sad": ["😢", "😭", "😔", "😞"],
    "excited": ["😃", "😍", "🤩"],
    "laugh": ["😂", "🤣"],
    "love": ["😍", "😘", "🥰"],
    "smile": ["😊", "🙂", "😌"],
    "cry": ["😭", "😢", "😔"],
    "kiss": ["😘", "😚", "😗"],
    "funny": ["😂", "🤣", "😜"],
    "cool": ["😎", "🕶️", "😏"],
    "adore": ["🥰", "😍", "😘"],
    "clap": ["👏", "🙌", "👍"],
    "thankful": ["🙏", "😊", "😇"],
    "disappointed": ["😔", "😞", "😕"],
    "awkward": ["😅", "😬", "😳"],
    "playful": ["😜", "😉", "😋"],
    "sleepy": ["😴", "😪", "😫"],
    "satisfied": ["😊", "😌", "🙂"],
    "surprised": ["😳", "😱", "😮"],
    "angelic": ["😇", "😇😇", "😇😇😇"],
    "confused": ["🤔", "😕", "😖"],
    "hug": ["🤗", "🤗🤗", "🤗🤗🤗"],
    "speechless": ["😑", "😶"],
    "curious": ["😕", "🤔", "🧐"],
    "whatever": ["🤷‍♀️", "🤷‍♂️", "🤷"]
}
